
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ISAWASHUN/aws-ecs-terraform/actions/runs/7026575230)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3ef89bfa78b0582]
aws_security_group.ecs: Refreshing state... [id=sg-09e7170c13ba44315]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00c0ff2d63eb7c1b5]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04644499e1d35015a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7b762bcf5433586]
aws_security_group.alb: Refreshing state... [id=sg-0aebc2e899f086fe5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05a4d2914ca9edc60]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f501f908d74e8b94]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f9db97024b495556]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02f39c8c10ab62646]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09afe4d2b31cc1a60]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0279be51cdd95b4c7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05a9889ad7aa47660]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d9de1c8bc96a790d]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2523706584]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0685761d5db013174]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db33977869800d9a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f501f908d74e8b941080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb0b19157666a587]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-047e343b5a41f48ac]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0684b2b24e88ad24a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0699329c02acfbf41]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0972f78fece1f608c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0df7b7b9e8938f85a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02f39c8c10ab626461080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09afe4d2b31cc1a601080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0aebc2e899f086fe5",
        ]
      + subnets                                     = [
          + "subnet-05a4d2914ca9edc60",
          + "subnet-0f9db97024b495556",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0b3ef89bfa78b0582"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:targetgroup/go-simple-server-target-group/7f1ffbb450bcb047]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Creation complete after 2m54s [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:loadbalancer/app/go-simple-server-alb/d39af7559b0cb93f]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener-rule/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0/49418536847c9a9a]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"65757bb217b7ba1b15aa4e1d219bc37c7bad0624","Vars":{},"WorkflowName":"Terraform"} -->